singles.org
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: .
#+HUGO_WEIGHT: auto

** Projects
:PROPERTIES:
:EXPORT_FILE_NAME: projects
:END:

Over the last couple of years I worked on a number of open source
projects and also commercial ones. Most of them were Rust, along with
Clojure and Clojurescript.

This list is widely incomplete, lots of small things can be found on
my github profile.

*** Open Source Libraries

**** Rust:

- [[https://github.com/saskenuba/acls#?][ACLS]] - Another clojure lsp
  server, application - 2023
- [[https://github.com/saskenuba/SteamHelper-rs][SteamHelpers-rs]] - a
  collection of crates to interact with Valve's Steam, library - 2023
- [[https://github.com/saskenuba/pix-toolbelt][PIX Toolbelt]] - BACEN
  compliant PIX client and specification, library - 2022
- [[https://github.com/saskenuba/yapay-sdk-rust][Yapay SDK]] -
  Strongly typed client for YAPAY, library - 2022

*** Applications

- [[https://mercadoskin.com][MercadoSkin]] - Marketplace for CS2
  items, cashout for real money - 2024
