content/projects.md
+++
title = "Projects"
draft = false
weight = 2002
+++

Over the last couple of years I worked on a number of open source
projects and also commercial ones. Most of them were Rust, along with
Clojure and Clojurescript.

This list is widely incomplete, lots of small things can be found on
my github profile.


## Open Source Libraries {#open-source-libraries}


### Rust: {#rust}

-   [ACLS](https://github.com/saskenuba/acls#?) - Another clojure lsp
    server, application - 2023
-   [SteamHelpers-rs](https://github.com/saskenuba/SteamHelper-rs#?) - a
    collection of crates to interact with Valve's Steam, library - 2023
-   [PIX Toolbelt](https://github.com/saskenuba/pix-toolbelt#?) - BACEN
    compliant PIX client and specification, library - 2022
-   [Yapay SDK](https://github.com/saskenuba/yapay-sdk-rust#?) -
    Strongly typed client for YAPAY, library - 2022


## Applications {#applications}

-   [MercadoSkin](https://mercadoskin.com) - Marketplace for CS2
    items, cashout for real money - 2024
